app/controllers/parents_controller.rb

SELECT "parents".* FROM "parents"
---
  def index
    @parents = Parent.all

INSERT INTO "parents" ("first_name", "last_name", "email", "phone_number", "school", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @parent = Parent.new(parent_params)

    respond_to do |format|
      if @parent.save

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_parent
      @parent = Parent.find(params[:id])